# Join Function

In [1]:
import pandas as pd

In [15]:
df1 = pd.DataFrame({'A': [1,2,3],
                   'B': [10,20,30]},
                  index=['a','b','c'])
 
 
df2 = pd.DataFrame({'A': [4,5],
                   'D': [40,50]},
                  index=['a','b'])
 
display(df1, df2)

   A   B
a  1  10
b  2  20
c  3  30

   A   D
a  4  40
b  5  50

In [7]:
df1.join(df2)

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [8]:
df2.join(df1)

   C   D  A   B
a  4  40  1  10
b  5  50  2  20

In [5]:
# should be same index

In [11]:
df1.join(df2,how='right') #it prints the dataframe accrodingly right

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [12]:
df1.join(df2,how='inner')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [13]:
df1.join(df2,how='outer')

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [19]:
df1.join(df2,lsuffix='_1') #for the joining of same colom name

   A_1   B    A     D
a    1  10  4.0  40.0
b    2  20  5.0  50.0
c    3  30  NaN   NaN

In [20]:
df1.join(df2,rsuffix='_1')

   A   B  A_1     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN